require 'minitest/autorun'
require 'greeklish_iso843'

class GreeklishIso843::ConverterTest < Minitest::Test
  TEST_PAIRS = {
    'παιδιά' => 'paidia', # αι
    'φταίνε' => 'ftaine', # αί

    'ποιήμα' => 'poiima', # οι
    'αυτοί' => 'aftoi', # οί

    'όπου' => 'opou', # ου
    'αυτού' => 'aftou', # ού

    'τρέχει' => 'trechei', # ει
    'εκεί' => 'ekei', # εί

    'ντόμινο' => 'ntomino', # ντ

    'τσάι' => 'tsai', # τσ

    'τζατζίκι' => 'tzatziki', # τζ

    'άγγελος' => 'angelos', # γγ

    'αγκώνας' => 'agkonas', # γκ

    'άγχος' => 'anchos', # γχ

    'ελέγξω' => 'elenxo', # γξ

    'έπαυα' => 'epava', # αυα
    # αυά
    'έπαυε' => 'epave', # αυε
    # αυέ
    # αυη
    # αυή
    # αυι
    # αυί
    # αυï
    # αυΐ
    # αυο
    # αυό
    # αυυ
    # αυύ
    # αυϋ
    # αυΰ
    # αυω
    # αυώ
    # αυβ
    'αυγή' => 'avgi', # αυγ
    'άναυδος' => 'anavdos', # αυδ
    # αυζ
    'αυλή' => 'avli', # αυλ
    # αυμ
    'αυνανίζομαι' => 'avnanizomai', # αυν
    'αυριανισμός' => 'avrianismos', # αυρ

    # αυθ
    # αυκ
    'αυξητικός' => 'afxitikos', # αυξ
    # αυπ
    'αυστηρός' => 'afstiros', # αυσ
    'αυτό' => 'afto', # αυτ
    # αυφ
    # αυχ
    # αυψ
    # *αυ

    # αύα
    # αύε
    # αύη
    # αύι
    # αύï
    # αύο
    # αύυ
    # αύϋ
    'παύω' => 'pavo', # αύω
    # αύβ
    # αύγ
    # αύδ
    # αύζ
    # αύλ
    'θαύμα' => 'thavma', # αύμ
    # αύν
    'αύριο' => 'avrio', # αύρ

    # αύθ
    # αύκ
    'αύξηση' => 'afxisi', # αύξ
    # αύπ
    # αύσ
    # αύτ
    # αύφ
    # αύχ
    # αύψ
    # *αύ

    'σκόπευα' => 'skopeva', # ευα
    'Ευάγγελος' => 'Evangelos', # # ευά
    'σκόπευε' => 'skopeve', # ευε
    # ευέ
    # ευη
    # ευή
    # ευι
    # ευί
    # ευï
    # ευΐ
    # ευο
    # ευό
    # ευυ
    # ευύ
    # ευϋ
    # ευΰ
    # ευω
    # ευώ
    # ευβ
    # ευγ
    'ευδοκιμώ' => 'evdokimo', # ευδ
    # ευζ
    'ευλαβής' => 'evlavis', # ευλ
    'ευμετάβλητος' => 'evmetavlitos', # ευμ
    'ευνομία' => 'evnomia', # ευν
    'ευρύς' => 'evrys', # ευρ

    'ευθύς' => 'efthys', # ευθ
    'ευκατάστατος' => 'efkatastatos', # ευκ
    # ευξ
    'ευπατρίδης' => 'efpatridis', # ευπ
    # ευσ
    'ευτυχισμένος' => 'eftychismenos', # ευτ
    'ευφυής' => 'effyis', # ευφ
    'ευχάριστος' => 'efcharistos', # ευχ
    # ευψ
    'άνευ' => 'anef', # *ευ

    # εύα
    # εύε
    'εύηχος' => 'evichos', # εύη
    # εύι
    # εύï
    # εύο
    # εύυ
    # εύϋ
    'σκοπεύω' => 'skopevo', # εύω
    'Εύβοια' => 'Evvoia', # εύβ
    'εύγευστος' => 'evgefstos', # εύγ
    # εύδ
    'Εύζωνες' => 'Evzones', # εύζ
    'εύληπτος' => 'evliptos', # εύλ
    # εύμ
    'Εύνομος' => 'Evnomos', # εύν
    # εύρ

    # εύθ
    'εύκρατος' => 'efkratos', # εύκ
    'Εύξεινος' => 'Efxeinos', # εύξ
    'εύπορος' => 'efporos', # εύπ
    'εύσημα' => 'efsima', # εύσ
    # εύτ
    # εύφ
    # εύχ
    # εύψ
    # *εύ

    # ηυα
    # ηυά
    # ηυε
    # ηυέ
    # ηυη
    # ηυή
    # ηυι
    # ηυί
    # ηυï
    # ηυΐ
    # ηυο
    # ηυό
    # ηυυ
    # ηυύ
    # ηυϋ
    # ηυΰ
    # ηυω
    # ηυώ
    # ηυβ
    # ηυγ
    # ηυδ
    # ηυζ
    # ηυλ
    # ηυμ
    # ηυν
    # ηυρ

    # ηυθ
    # ηυκ
    # ηυξ
    # ηυπ
    # ηυσ
    # ηυτ
    # ηυφ
    # ηυχ
    # ηυψ
    # *ηυ

    # ηύα
    # ηύε
    # ηύη
    # ηύι
    # ηύï
    # ηύο
    # ηύυ
    # ηύϋ
    # ηύω
    # ηύβ
    # ηύγ
    # ηύδ
    # ηύζ
    # ηύλ
    # ηύμ
    # ηύν
    # ηύρ

    # ηύθ
    # ηύκ
    # ηύξ
    # ηύπ
    # ηύσ
    # ηύτ
    # ηύφ
    # ηύχ
    # ηύψ
    # *ηύ

    'Μπάμπης' => 'Bampis', # μπ* *μπ*
    'κεμπάμπ' => 'kempab', # *μπ* *μπ

    'ξεσκεπάζω την ψυχοφθόρα σας βδελυγμία' => 'xeskepazo tin psychofthora sas vdelygmia', # pangram

    'σκετς' => 'skets', # *τς
    'σκετσάκι' => 'sketsaki', # *τσ*
  }.freeze

  TEST_PAIRS.each do |greek, greeklish|
    name = greeklish.
      downcase.
      gsub(/[^\w[[:space:]]]+/, '').
      gsub(/[[:space:]]+/, '_')

    define_method "test_#{name}" do
      assert_equal GreeklishIso843::Converter.convert(greek), greeklish
    end
  end
end
